# Task 05 - Part 1 of 2: SQL Aggregations & GROUP BY

**Course:** Database Applications Development  
**Lesson:** 05 - SQL Aggregations, Grouping, and Excel Export (in Part 2) 

---

## Instructions

Complete all exercises in this notebook. You will:
1. Write SQL queries using aggregate functions
2. Use GROUP BY to analyze categories
3. Export 4 query results to Excel files
4. Answer analysis questions

**Resources:**
- Lesson materials (dbApps05_AggregationsGrouping.md)
- Walkthrough notebook (dbApps05_Walkthrough.ipynb)
- SQL Reference Guide (updated with aggregations)

**Submission:**
1. Complete all TODO sections
2. Verify all cells run without errors
3. Check that Excel files were created (in Part 2)
4. Push to GitHub: `databaseApplications/dbApps05TasksPart1.ipynb`

Let's practice aggregations!

---

## Setup

In [3]:
import pandas as pd
import sqlite3

# Connect to database
conn = sqlite3.connect('nba_5seasons.db')
print("✅ Connected to database")

✅ Connected to database

---

## Part 1: Basic Aggregate Functions (10 queries)

Practice using COUNT, SUM, AVG, MIN, and MAX without GROUP BY.

**Hints:**
- Remember to use AS to name your result columns
- Aggregate functions work on ALL rows that match your WHERE clause
- Use ROUND(AVG(column), 1) to round decimals

### Query 1: Count All Teams

**Task:** How many teams are in the database?

**Hint:** Use COUNT(*) on the `teams` table.

In [4]:
# TODO: Write your query
query_1 = """
SELECT COUNT(*)
FROM teams
"""

result_1 = pd.read_sql(query_1, conn)
display(result_1)

   COUNT(*)
0        30

### Query 2: Count Player Season Records

**Task:** How many player-season records exist for 2021-22?

**Hint:** COUNT(*) from `player_season_stats` WHERE season = '2021-22'

In [5]:
# TODO: Write your query
query_2 = """
SELECT COUNT(*)
FROM player_season_stats
WHERE season = '2021-22'
"""

result_2 = pd.read_sql(query_2, conn)
display(result_2)

   COUNT(*)
0       605

### Query 3: Total Points (All Teams)

**Task:** What were the total combined points scored by all teams in all 2021-22 games?

**Hint:** SUM(pts) from `team_game_stats` WHERE season = '2021-22'

In [6]:
# TODO: Write your query
query_3 = """
SELECT SUM(pts)
FROM team_game_stats
WHERE season = '2021-22'
"""

result_3 = pd.read_sql(query_3, conn)
display(result_3)

   SUM(pts)
0    272115

### Query 4: Average Points Per Game (League-Wide)

**Task:** What was the league-wide average points per game in 2021-22?

**Hint:** AVG(pts), remember to round to 1 decimal place  (`team_game_stats` table)

In [7]:
# TODO: Write your query
query_4 = """
SELECT AVG(pts)
FROM team_game_stats
WHERE season = '2021-22'
"""

result_4 = pd.read_sql(query_4, conn)
display(result_4)

     AVG(pts)
0  110.615854

### Query 5: Highest and Lowest Scores

**Task:** Find the highest and lowest points scored in any single game during 2021-22.

**Hint:** Use both MAX(pts) and MIN(pts) in one query  (`team_game_stats` table)

In [8]:
# TODO: Write your query
query_5 = """
SELECT MAX(pts) AND MIN(pts)
FROM team_game_stats
WHERE season = '2021-22'
"""

result_5 = pd.read_sql(query_5, conn)
display(result_5)

   MAX(pts) AND MIN(pts)
0                      1

### Query 6: Lakers Total Points

**Task:** How many total points did the Lakers (team_id = 1610612747) score in 2021-22?

**Hint:** SUM(pts) with WHERE for team_id AND season  (`team_game_stats` table)

In [9]:
# TODO: Write your query
query_6 = """
SELECT SUM(pts)
FROM team_game_stats
WHERE team_id = 1610612747
AND season = '2021-22'
"""

result_6 = pd.read_sql(query_6, conn)
display(result_6)

   SUM(pts)
0      9192

### Query 7: Warriors Average Points

**Task:** What was the Warriors' (team_id = 1610612744) average points per game in 2021-22?

**Hint:** AVG(pts), round to 1 decimal (`team_game_stats` table)

In [10]:
# TODO: Write your query
query_7 = """
SELECT avg(pts)
FROM team_game_stats
WHERE team_id = 1610612744
AND season = '2021-22'
"""

result_7 = pd.read_sql(query_7, conn)
display(result_7)

   avg(pts)
0     111.0

### Query 8: Complete Summary Statistics

**Task:** Create a summary with COUNT, SUM, AVG, MIN, and MAX for 'pts' for all games in 2021-22.

**Hint:** Use all 5 aggregate functions in one SELECT statement from the `team_game_stats` table

In [26]:
# TODO: Write your query
query_8 = """
SELECT
    COUNT(*) as total_games,
    SUM(pts) as total_points,
    AVG(pts) as avg_points,
    MIN(pts) as min_score,
    MAX(pts) as max_score
FROM team_game_stats
WHERE season = '2021-22'
"""

result_8 = pd.read_sql(query_8, conn)
display(result_8)

   total_games  total_points  avg_points  min_score  max_score
0         2460        272115  110.615854         75        158

### Query 9: Count Teams by State

**Task:** How many teams are located in California?

**Hint:** COUNT(*) from `teams` WHERE state = 'California'

In [ ]:
# TODO: Write your query
query_9 = """
SELECT COUNT(*)
FROM teams
WHERE state='California'
"""

result_9 = pd.read_sql(query_9, conn)
display(result_9)

### Query 10: Oldest Team

**Task:** What is the earliest year_founded in the `teams` table?

**Hint:** MIN(year_founded)

In [ ]:
# TODO: Write your query
query_10 = """
SELECT MIN(year_founded)
FROM teams
"""

result_10 = pd.read_sql(query_10, conn)
display(result_10)

---

## Part 2: GROUP BY Queries (8 queries)

Practice grouping data and aggregating by category.

**Remember:**
- Every non-aggregated column in SELECT must be in GROUP BY
- GROUP BY creates separate groups for aggregation
- Use ORDER BY to sort your results

### Query 11: Games Per Team

**Task:** How many games did each team play in 2021-22?

**Hint:** SELECT team_id, COUNT(*) ... GROUP BY team_id

In [ ]:
# TODO: Write your query
query_11 = """
SELECT team_id, COUNT(*)
FROM teams
GROUP BY team_id
"""

result_11 = pd.read_sql(query_11, conn)
display(result_11.head(10))  # Show first 10 teams

### Query 12: Average Points By Team

**Task:** Calculate average points per game for each team in 2021-22. Sort by highest average first.

**Hint:** GROUP BY team_id, ORDER BY avg_points DESC

In [ ]:
# TODO: Write your query
query_12 = """
SELECT team_id, AVG(pts) AS avg_points
FROM player_season_stats
WHERE season = '2021-22'
GROUP BY team_id
ORDER BY avg_points DESC
"""

result_12 = pd.read_sql(query_12, conn)
display(result_12.head(10))  # Show first 10 teams

### Query 13: Team Performance with Names

**Task:** Show team name, games played, and average points for each team in 2021-22.

**Hint:** JOIN teams with team_game_stats, then GROUP BY

Recall from the walkthrough how JOIN operations work, here's an example:

SELECT <br>
    t.full_name as team,<br>
    t.city,<br>
    COUNT(tgs.game_id) as games_played<br>
FROM teams t<br>
JOIN team_game_stats tgs ON t.team_id = tgs.team_id<br>
WHERE tgs.season = '2021-22'<br>
GROUP BY t.team_id, t.full_name, t.city<br>
ORDER BY games_played DESC<br>
LIMIT 10

In [14]:
# TODO: Write your query
query_13 = """
SELECT
t.full_name as team,
COUNT(tgs.game_id) as games_played,
AVG(pts) AS avg_points
FROM teams t
JOIN team_game_stats tgs ON t.team_id = tgs.team_id
WHERE tgs.season = '2021-22'
GROUP BY t.team_id, t.full_name, t.city
ORDER BY games_played DESC
LIMIT 10
"""

result_13 = pd.read_sql(query_13, conn)
display(result_13.head(10))

                    team  games_played  avg_points
0          Atlanta Hawks            82  113.939024
1         Boston Celtics            82  111.756098
2    Cleveland Cavaliers            82  107.792683
3   New Orleans Pelicans            82  109.292683
4          Chicago Bulls            82  111.609756
5       Dallas Mavericks            82  108.024390
6         Denver Nuggets            82  112.719512
7  Golden State Warriors            82  111.000000
8        Houston Rockets            82  109.719512
9   Los Angeles Clippers            82  108.414634

### Query 14: Total Points By Team

**Task:** Calculate total points scored by each team in 2021-22. Include team name.

**Hint:** SUM(pts), JOIN with `team_game_stats` with the `teams` table, GROUP BY team

In [15]:
# TODO: Write your query
query_14 = """
SELECT
t.full_name as team,
SUM(pts) AS total_pts
FROM teams t
JOIN team_game_stats tgs ON t.team_id = tgs.team_id
WHERE tgs.season = '2021-22'
GROUP BY t.team_id, t.full_name, t.city
LIMIT 10
"""

result_14 = pd.read_sql(query_14, conn)
display(result_14.head(30))

                    team  total_pts
0          Atlanta Hawks       9343
1         Boston Celtics       9164
2    Cleveland Cavaliers       8839
3   New Orleans Pelicans       8962
4          Chicago Bulls       9152
5       Dallas Mavericks       8858
6         Denver Nuggets       9243
7  Golden State Warriors       9102
8        Houston Rockets       8997
9   Los Angeles Clippers       8890

### Query 15: Season High by Team

**Task:** Find each team's highest-scoring game in 2021-22. Include team name and sort by highest game.

**Hint:** MAX(pts), JOIN, GROUP BY, ORDER BY DESC

In [16]:
# TODO: Write your query
query_15 = """
SELECT
t.full_name as team,
MAX(pts) AS high_pts
FROM teams t
JOIN team_game_stats tgs ON t.team_id = tgs.team_id
WHERE tgs.season = '2021-22'
GROUP BY t.team_id, t.full_name, t.city
ORDER BY high_pts DESC
LIMIT 10
"""

result_15 = pd.read_sql(query_15, conn)
display(result_15.head(10))

                     team  high_pts
0       Charlotte Hornets       158
1       San Antonio Spurs       157
2    Los Angeles Clippers       153
3      Washington Wizards       153
4       Memphis Grizzlies       152
5           Brooklyn Nets       150
6  Minnesota Timberwolves       149
7         Houston Rockets       146
8      Los Angeles Lakers       146
9          Boston Celtics       145

### Query 16: Win Count by Team

**Task:** Count how many wins each team had in 2021-22.

**Hint:** Use SUM(CASE WHEN wl = 'W' THEN 1 ELSE 0 END) to count wins

In [17]:
# TODO: Write your query
query_16 = """
SELECT
t.full_name as team,
SUM(CASE WHEN wl = 'W' THEN 1 ELSE 0 END) AS total_wins
FROM teams t
JOIN team_game_stats tgs ON t.team_id = tgs.team_id
WHERE tgs.season = '2021-22'
GROUP BY t.team_id, t.full_name, t.city
LIMIT 10
"""

result_16 = pd.read_sql(query_16, conn)
display(result_16.head(10))

                    team  total_wins
0          Atlanta Hawks          43
1         Boston Celtics          51
2    Cleveland Cavaliers          44
3   New Orleans Pelicans          36
4          Chicago Bulls          46
5       Dallas Mavericks          52
6         Denver Nuggets          48
7  Golden State Warriors          53
8        Houston Rockets          20
9   Los Angeles Clippers          42

### Query 17: Teams by State

**Task:** Count how many teams are in each state.

**Hint:** GROUP BY state from teams table

In [24]:
# TODO: Write your query
query_17 = """
SELECT
t.state,
COUNT(tgs.state) as State_teams
FROM teams t
JOIN teams tgs ON t.state = tgs.state
GROUP BY t.state, t.full_name, t.city
LIMIT 10
"""

result_17 = pd.read_sql(query_17, conn)
display(result_17.head(10))

                  state  State_teams
0               Arizona            1
1            California            4
2            California            4
3            California            4
4            California            4
5              Colorado            1
6  District of Columbia            1
7               Florida            2
8               Florida            2
9               Georgia            1

### Query 18: Players Per Team

**Task:** Count how many player-season records each team has for 2021-22.

**Hint:** COUNT(*) from player_season_stats, GROUP BY team_id

In [25]:
# TODO: Write your query
query_18 = """
SELECT
tgs.season as Season,
t.full_name as team,
COUNT(tgs.game_id) as games_played,
AVG(pts) AS avg_points
FROM teams t
JOIN team_game_stats tgs ON t.team_id = tgs.team_id
GROUP BY t.team_id, t.full_name, t.city
ORDER BY games_played DESC
LIMIT 10
"""

result_18 = pd.read_sql(query_18, conn)
display(result_18.head(10))

    Season                    team  games_played  avg_points
0  2021-22           Atlanta Hawks           363  117.415978
1  2021-22     Cleveland Cavaliers           363  114.231405
2  2021-22    New Orleans Pelicans           363  112.473829
3  2021-22        Dallas Mavericks           363  113.573003
4  2021-22         Toronto Raptors           363  111.603306
5  2021-22   Golden State Warriors           362  115.395028
6  2021-22              Miami Heat           362  111.077348
7  2021-22         Milwaukee Bucks           362  116.381215
8  2021-22  Minnesota Timberwolves           362  115.124309
9  2021-22           Orlando Magic           362  108.704420

## You've completed Part 1 - Nice Work!

## Now move onto Part 2!